# coding: utf-8

# Python. Быстрый старт.
# Занятие 1.

# Домашнее задание: установить интерпретатор;
#    выполнить действия в интерпретаторе;
#    дописать скрипт, чтобы он перед приветствием выводил название программы


# Строка, начинающаяся с решётки #  - это комментарий, т.е. не выполняется

# Функция print выводит сообщение в командной строке
print('Я Чудо-программа!')
print("Привет, программист!")
print('10/3 = ' + str(10/3))    # вещественное деление
print('10//3 = ' + str(10//3))  # целочисленное деление
print('10%3 = ' + str(10%3))    # остаток от деления
print('10**3 = ' + str(10**3))  # возведение в степень

